In [175]:
import pandas as pd
import numpy as np
import os
from os import getcwd
pd.options.display.max_columns = None

###  Pair Programming Pandas VI

In [176]:
# Es el momento de poner en pr치ctica los groupby de pandas. 
# Para esto vamos a trabajar con el csv creado en el ejercicio de pair programming anterior.
# El objetivo de este ejercicio es agrupar los datos para contestar las siguientes preguntas:

In [177]:
df_union = pd.read_csv("05-attacks_union.csv", index_col=0 )# ponemos esto para que no nos agrege mas unnamed
df_union.head(1)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

In [178]:
df_union.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href',
       'Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'Case Number.1',
       'Case Number.2', 'original order', 'Unnamed: 22', 'Unnamed: 23',
       'fatal_(y/n)', 'injury', 'date'],
      dtype='object')

In [179]:
df_union.shape

(6284, 36)

In [180]:
df_union.describe().T

,count,mean,std,min,25%,50%,75%,max
year,6114.0,1968.831207,43.745920,1801.0,1946.00,1980.0,2005.00,2018.0
Year,170.0,428.617647,744.448512,0.0,0.00,0.0,394.25,1800.0
original order,170.0,86.500000,49.218899,2.0,44.25,86.5,128.75,171.0
Unnamed: 22,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Unnamed: 23,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 1. 쮺u치ntos ataques hubo por pa칤s? Devuelve un DataFrame.
游늷 NOTA Ordena los resultados de mayor a menor. 
Esto todav칤a no lo hemos visto, pero un DataFrame lo podemos ordenar con .sort_values().ten칠is una explicaci칩n de c칩mo hacerlo.

In [181]:
df_groupby_pais = pd.DataFrame(df_union.groupby("country")['country'].count())# importante la funcion de agregaci칩n
df_groupby_pais.columns = ['ataques']# renombrar la columna porque se llaman igual
df_groupby_pais.sort_values(by='ataques', ascending=False, inplace=True)
df_groupby_pais

                       ataques
country
USA                       2200
AUSTRALIA                 1316
SOUTH AFRICA               569
PAPUA NEW GUINEA           130
NEW ZEALAND                126
...                        ...
NORTH SEA                    1
NORTH ATLANTIC OCEAN         1
NICARAGUA                    1
EGYPT / ISRAEL               1
 PHILIPPINES                 1

[201 rows x 1 columns]

### 2. 쮺u치ntos ataques ha habido por a침o? Devuelve un DataFrame.
De nuevo ordena los resultados de mayor a menor.

In [182]:
df_union.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,Minor injury to left thigh,18-Jun-2018

In [183]:
df_groupby_anio = pd.DataFrame(df_union.groupby("year")['year'].count())
df_groupby_anio.columns = ['ataques']# renombrar la columna porque se llaman igual
df_groupby_anio.sort_values(by='ataques', ascending=False, inplace=True)
df_groupby_anio

        ataques
year
2015.0      143
2017.0      136
2016.0      130
2011.0      128
2014.0      126
...         ...
1819.0        1
1822.0        1
1823.0        1
1859.0        1
1801.0        1

[207 rows x 1 columns]

### 3. 쮺u치ntos ataques hubo por a침o y sexo? Devolved un DataFrame solo del a침o 2000 en adelante.

In [184]:
df_union.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,Minor injury to left thigh,18-Jun-2018

In [185]:
df_groupby_anio = pd.DataFrame(df_union.groupby(["year","sex"])['year'].count())
df_groupby_anio.columns = ['ataques']# renombrar la columna porque se llaman igual
df_groupby_anio.sort_values(by='ataques', ascending=False, inplace=True)
df_groupby_anio

            ataques
year   sex
2015.0 M        114
2011.0 M        109
2016.0 M        105
2008.0 M        103
2013.0 M        101
...             ...
1855.0 F          1
1936.0 F          1
2004.0 lli        1
1934.0 N          1
1801.0 N          1

[314 rows x 1 columns]

In [186]:
df_groupby_sex = pd.DataFrame(df_union.groupby(["year","sex"])['case_number'].count()).reset_index()
df_groupby_sexo = df_groupby_sex[df_groupby_sex['year']>2000]
df_groupby_sexo.columns = ['year','sex','ataques']
df_groupby_sexo.head(5)

       year sex  ataques
275  2001.0   F       13
276  2001.0   M       71
277  2002.0   F        9
278  2002.0   M       73
279  2003.0   F       12

### 4. Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA.
쮺u치ntos de los ataques fueron letales por sexo? Devuelve un DataFrame.

In [187]:
df_union.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,Minor injury to left thigh,18-Jun-2018

In [188]:
df_groupby_paises = df_union[df_union['country'].isin(['USA','AUSTRALIA','SOUTH AFRICA'])]
df_groupby_paises.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,Minor injury to left thigh,18-Jun-2018

In [189]:
df_fatales = df_groupby_paises[df_groupby_paises["fatal_(y/n)"]=="Y"]
df_fatales.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
91,2017.09.03.b,2017.0,Unprovoked,SOUTH AFRICA,Western Cape Province,Dyer Island,"Swimming, poaching abalone",Sivuyile Xelela,M,NaN,Morning,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Y,FATAL,03-Sep-2017
155,2017.04.17.a,2017.0,Unprovoked,AUSTRALIA,Western Australia,Kelpies near Wylie Bay,Surfing,Laeticia Brouwer,F,17,16h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Y,FATAL,17-Apr-2017

In [190]:
df_fatales_sex = df_fatales.groupby('sex')['case_number'].agg(ataques=('count'))
df_fatales_sex = df_fatales_sex.reset_index()
df_fatales_sex

  sex  ataques
0   F       34
1   M      510

# 5. 쮼n qu칠 pa칤s hubo m치s ataques?
Usando el DataFrame creado en el ejercicio anterior.

In [193]:
df_groupby_paises = df_union[df_union['country'].isin(['USA','AUSTRALIA','SOUTH AFRICA'])].max()
df_groupby_paises.head(2)

/tmp/ipykernel_20457/3470835125.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_groupby_paises = df_union[df_union['country'].isin(['USA','AUSTRALIA','SOUTH AFRICA'])].max()

year       2018.0
country       USA
dtype: object

# 6. 쯈u칠 y cu치ntos tipos de ataques hubo por pa칤s?

In [194]:
df_groupby_paises2 = df_union.groupby(["type", "country"])["case_number"].agg(ataques=('count'))
df_ataque_paises = df_groupby_paises2.reset_index()
df_ataque_paises

           type        country  ataques
0          Boat      AUSTRALIA       38
1          Boat         AZORES        1
2          Boat        BERMUDA        1
3          Boat  CARIBBEAN SEA        1
4          Boat           CUBA        1
..          ...            ...      ...
413  Unprovoked        VIETNAM       10
414  Unprovoked    WEST INDIES        2
415  Unprovoked  WESTERN SAMOA        1
416  Unprovoked          YEMEN        2
417  Unprovoked         YEMEN         5

[418 rows x 3 columns]